I can verify that this fixes the bug in https://github.com/hashicorp/terraform-provider-aws/issues/33701.

Sample output from v5.35.0 (latest at the time of writing):
```
$ terraform version
Terraform v1.5.7
on darwin_amd64
+ provider registry.terraform.io/hashicorp/aws v5.35.0

$ terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ram_resource_share_accepter.accepter will be created
  + resource "aws_ram_resource_share_accepter" "accepter" {
      + id                  = (known after apply)
      + invitation_arn      = (known after apply)
      + receiver_account_id = (known after apply)
      + resources           = (known after apply)
      + sender_account_id   = (known after apply)
      + share_arn           = "arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54"
      + share_id            = (known after apply)
      + share_name          = (known after apply)
      + status              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ram_resource_share_accepter.accepter: Creating...
╷
│ Error: reading RAM Resource Share (arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54): couldn't find resource
│
│   with aws_ram_resource_share_accepter.accepter,
│   on main.tf line 15, in resource "aws_ram_resource_share_accepter" "accepter":
│   15: resource "aws_ram_resource_share_accepter" "accepter" {
│

$ terraform apply
aws_ram_resource_share_accepter.accepter: Refreshing state... [id=arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ram_resource_share_accepter.accepter is tainted, so must be replaced
-/+ resource "aws_ram_resource_share_accepter" "accepter" {
      ~ id                  = "arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54" -> (known after apply)
      ~ invitation_arn      = "arn:aws:ram:us-east-1:REDACTED:resource-share-invitation/8777159a-REDACTED-b36d-36d46cc0584d" -> (known after apply)
      ~ receiver_account_id = "REDACTED" -> (known after apply)
      ~ resources           = [
          - "arn:aws:glue:us-east-1:REDACTED:catalog",
        ] -> (known after apply)
      ~ sender_account_id   = "REDACTED" -> (known after apply)
      ~ share_id            = "rs-9271dcec-REDACTED-8c0d-b781c8900c54" -> (known after apply)
      ~ share_name          = "test-resource-share" -> (known after apply)
      ~ status              = "ACTIVE" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ram_resource_share_accepter.accepter: Destroying... [id=arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54]
aws_ram_resource_share_accepter.accepter: Destruction complete after 1s
aws_ram_resource_share_accepter.accepter: Creating...
aws_ram_resource_share_accepter.accepter: Still creating... [10s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [20s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [30s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [40s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [50s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m0s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m10s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m20s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m30s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m40s elapsed]
aws_ram_resource_share_accepter.accepter: Still creating... [1m50s elapsed]
╷
│ Error: No RAM Resource Share (arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54) invitation found
│
│ NOTE: If both AWS accounts are in the same AWS Organization and RAM Sharing with AWS Organizations is enabled, this resource is not necessary
│
│   with aws_ram_resource_share_accepter.accepter,
│   on main.tf line 15, in resource "aws_ram_resource_share_accepter" "accepter":
│   15: resource "aws_ram_resource_share_accepter" "accepter" {
│
```

Sample output from patched v5.35.0:
```
$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/aws in /Users/doellerich/go/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ram_resource_share_accepter.accepter will be created
  + resource "aws_ram_resource_share_accepter" "accepter" {
      + id                  = (known after apply)
      + invitation_arn      = (known after apply)
      + receiver_account_id = (known after apply)
      + resources           = (known after apply)
      + sender_account_id   = (known after apply)
      + share_arn           = "arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54"
      + share_id            = (known after apply)
      + share_name          = (known after apply)
      + status              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ram_resource_share_accepter.accepter: Creating...
aws_ram_resource_share_accepter.accepter: Creation complete after 5s [id=arn:aws:ram:us-east-1:REDACTED:resource-share/9271dcec-REDACTED-8c0d-b781c8900c54]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
